<?php
//**************************************************************************************************************************************************
// AJAX TEST通信用　PHP
// 
//**************************************************************************************************************************************************

//**************************************************************************************************************************************************
// ファイル読み込み
//**************************************************************************************************************************************************

//共通定義PHP読み込み
require_once('../common/common_def.php');
//共通関数PHP読み込み
require_once('../common/common_function.php');
//DB共通関数PHP読み込み
require_once('../model/jinji_db_model_function.php');
//DB接続定義PHP読み込み
require_once('../common/db_config_project.php');

//**************************************************************************************************************************************************
// 初期設定
//**************************************************************************************************************************************************

//*************************************************************************
// 初期定数・変数定義
//*************************************************************************
define("PHPNAME", "doLogin.php");		//PHPファイル名
$JSON_Array 	= array(); 							//出力JSON全データで使用
$FunctionID 	= "";								//FunctionID
$return_data 	= null;								//データ変換用
$result 		= null;								//DB処理時結果
$json_tmp 		= null;								//jsonデータ一時保管用

//*************************************************************************
// 初期処理
//*************************************************************************
//セッション開始
if (!isset($_SESSION)) {
	session_start();
}

//Header宣言(データをJSON形式で出力)
header('Content-Type: application/json; charset=UTF-8');


// ログイン有無確認
/*
	$json_tmp		= null;
	if(!isset($_SESSION["kintai_admin_uNo"])){
		$json_tmp = [
			'sts' 	=> "-1",
			'URL' 	=> LINK_SESSION_ADMIN_OUT_URL,
		];
		$JSON_Array += array("SessionConfig"=>$json_tmp);
		exitAccess($JSON_Array);
	}else{
		$json_tmp = [
			'sts' 	=> "1",
			'lev' 	=> $_SESSION["kintai_lev"]
		];
		$JSON_Array += array("SessionConfig"=>$json_tmp);
	}
*/
//データベースアクセス
$dbh_JINJI = dbConectSel_JINJI();

// FunctionID取得
if (isset($_POST["fID"])) {
	$FunctionID = Trim($_POST['fID']);
}

//**************************************************************************************************************************************************
// Ajax コントローラー
//**************************************************************************************************************************************************

/*************************************************************
 * ログイン
 *************************************************************/
if ($FunctionID == 'doLogin') {
	$return_data 	= "";
	$json_tmp		= "";


	try {
		$LID = Trim($_POST["LID"]);
		$Pass = Trim($_POST["Pass"]);
		$return_data = doLogin($LID, $Pass);

		$json_tmp = [
			'sts' 	=> "1",
			'data'	=> $return_data,
			'Mess'	=> "",
		];
	} catch (Exception $e) {
		$json_tmp = [
			'sts' 	=> "-1",
			'Ttl'	=> "エラー",
			'Mess'	=> ERR0001,
		];
	}
	$JSON_Array += array("_doLogin" => $json_tmp);
}


//*************************************************************************
// JSONデータ掃き出し処理
//*************************************************************************
//JSONデータ出力
echo json_encode($JSON_Array, JSON_UNESCAPED_UNICODE);
//データベースアクセス終了
$dbh_JINJI = null;
//JSON.PHP終了
exit;
